granel2/stm32f407vg_lan_tft/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include "lwip/init.h"
#include "lwip/netif.h"
#include "lwip/dhcp.h"
#include "lwip/timeouts.h"
#include "lwip/ip4_addr.h"
#include "netif/ethernet.h"
#include "ethernetif.h"
#include "tcp_echo_client.h"
#include "stm32f4xx_hal_eth.h"
#include "lwip/stats.h"
#include "tft_app.h"
#include "device_config.h"
#include "config_server.h"
#include "config_http.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
struct netif gnetif;
extern ETH_HandleTypeDef EthHandle; /* defined in ethernetif.c */
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void Test_Blink_LEDs(void);
/* USER CODE BEGIN PFP */
static void MX_LWIP_Init(void);
static void netif_status_callback(struct netif *netif);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  /* Hold the LAN8720 in reset (PB10/nRST) as early as firmware can run, before
     R3's 10k pull-up can release it on its own while VDD/clocks are still
     ramping up. Previously nRST wasn't touched by firmware until deep inside
     HAL_ETH_MspInit() (called from MX_LWIP_Init() below), well after
     SystemClock_Config() and other peripheral inits - confirmed on real
     hardware (PROJECT_GUIDE.md) that manually grounding nRST starting from
     power-up (instead of relying on R3 + this late firmware assert) was
     needed to reliably get the LAN8720's REFCLKO block to start. Asserting
     nRST here, before anything else, removes most of that gap; the actual
     5 s hold + release still happens later in HAL_ETH_MspInit(). */
  {
    GPIO_InitTypeDef nrst_early = {0};
    __HAL_RCC_GPIOB_CLK_ENABLE();
    nrst_early.Pin = GPIO_PIN_10;
    nrst_early.Mode = GPIO_MODE_OUTPUT_PP;
    nrst_early.Pull = GPIO_NOPULL;
    nrst_early.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOB, &nrst_early);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10, GPIO_PIN_RESET);
  }
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  TFT_App_GPIO_Init();
  MX_USART1_UART_Init();
  MX_USART3_UART_Init();
  /* USER CODE BEGIN 2 */
  /* Print the firmware build date/time on every boot (cold-boot or
     NVIC_SystemReset() escalation alike) so a pasted log can always be
     matched to the exact binary that produced it - __DATE__/__TIME__ are
     baked in by the compiler at build time, so this can't go stale the way
     a manually-maintained version number could. */
  {
    char boot_msg[64];
    snprintf(boot_msg, sizeof(boot_msg), "\r\n[boot] firmware built %s %s\r\n", __DATE__, __TIME__);
    Debug_Print(boot_msg);
  }
  /* Load persisted settings (server address, device name, static-IP-vs-DHCP
     choice - see Config/Inc/device_config.h) before anything that needs
     them: the SETUP page's SERVER:/NAME: rows below, and MX_LWIP_Init()'s
     static/DHCP branch further down. Falls back to compiled-in defaults on
     first boot (blank Flash) or a version mismatch. */
  device_config_load();

  /* TFT bring-up runs before lwIP so its blocking HAL_Delay()s can't stall
     Ethernet RX/DHCP; the panel just shows a static test pattern afterwards. */
  TFT_App_SPI3_Init();
  {
    const DeviceConfig *cfg = device_config_get();
    char server_str[24];
    snprintf(server_str, sizeof(server_str), "%u.%u.%u.%u:%u",
             cfg->server_ip[0], cfg->server_ip[1], cfg->server_ip[2], cfg->server_ip[3], cfg->server_port);
    TFT_App_SmokeTest(server_str, cfg->name);
  }
  MX_LWIP_Init();
  tcp_echo_client_init();
  config_server_init();
  config_http_init();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    Test_Blink_LEDs();
    config_http_poll();

    /* A config save (from the web page or the port-7000 text protocol) bumps
       device_config_revision(). React here, so neither config module needs
       to know about the display or the TCP client: refresh SERVER:/NAME: on
       the SETUP page, and if the server address itself changed, drop the
       current connection and reconnect to the new one right away. IP-mode
       changes are not handled here - they need a reboot (MX_LWIP_Init()). */
    {
      static uint32_t seen_rev = 0U;
      static uint8_t  seen_ip[4];
      static uint16_t seen_port;
      static uint8_t  seen_init = 0U;
      const DeviceConfig *cfg = device_config_get();

      if (seen_init == 0U)
      {
        memcpy(seen_ip, cfg->server_ip, sizeof(seen_ip));
        seen_port = cfg->server_port;
        seen_init = 1U;
      }
      if (device_config_revision() != seen_rev)
      {
        char server_str[24];

        seen_rev = device_config_revision();
        snprintf(server_str, sizeof(server_str), "%u.%u.%u.%u:%u",
                 cfg->server_ip[0], cfg->server_ip[1], cfg->server_ip[2], cfg->server_ip[3], cfg->server_port);
        TFT_App_UpdateInfo(server_str, cfg->name);

        if ((memcmp(seen_ip, cfg->server_ip, sizeof(seen_ip)) != 0) || (seen_port != cfg->server_port))
        {
          memcpy(seen_ip, cfg->server_ip, sizeof(seen_ip));
          seen_port = cfg->server_port;
          tcp_echo_client_restart();
        }
      }
    }

    /* Drain all pending ETH RX frames. Called unconditionally: the internal
       do-while exits immediately when nothing is pending, so the cost is one
       cheap HAL_ETH_ReadData call that returns NULL.  Avoids a race where
       EthRxPending was already cleared when the last ISR fired but a frame
       is still waiting in the DMA descriptor ring. */
    ethernetif_input(&gnetif);

    /* Poll PHY link state and lwIP's own timers (ARP, DHCP, TCP, ...) -
       NO_SYS=1 means nothing else is going to do this for us. */
    ethernetif_poll_link(&gnetif);
    sys_check_timeouts();

    /* Only talk to the server once we actually have an IP (DHCP-assigned). */
    {
      uint8_t has_ip = (netif_is_up(&gnetif) && !ip4_addr_isany_val(*netif_ip4_addr(&gnetif))) ? 1U : 0U;

      /* Feed the TFT status screen the same state this block already needs
         anyway - see tft_app.h for the ip_str/link_up/tcp_state contract.
         TFT_App_AlivePoll() rate-limits itself to 1 Hz internally, so
         calling it every loop iteration here is cheap. */
      TFT_App_AlivePoll(has_ip ? ip4addr_ntoa(netif_ip4_addr(&gnetif)) : "---",
                        netif_is_link_up(&gnetif) ? 1U : 0U,
                        tcp_echo_client_state_char());

      if (has_ip)
      {
        tcp_echo_client_poll();

        /* Show whatever the server just sent back on the LAST MSG: row for
           2 s (TFT_App_ShowReceived() handles the timing/blanking itself,
           non-blocking) - only when tcp_echo_client_poll() above actually
           drained something new, so an unrelated call here can't restart
           the 2 s timer on stale text. */
        {
          char rx_snapshot[220];  /* match tcp_echo_client.c's LAST_RX_SNAPSHOT_SIZE */
          if (tcp_echo_client_take_last_rx(rx_snapshot, sizeof(rx_snapshot)) > 0U)
          {
            TFT_App_ShowReceived(rx_snapshot);
          }
        }
      }

      /* Watchdog: DHCP lease loss/renewal clears the netif's IP
         (dhcp_release_and_stop() -> netif_set_addr(ANY)) until a fresh
         lease completes - confirmed in lwIP source (dhcp.c). While the IP
         is missing, tcp_echo_client_poll() above is skipped entirely, so
         the existing "3 failed TCP connects -> ethernetif_reset()" recovery
         path never gets a chance to run either - there is otherwise no
         self-healing at all for a stuck DHCP renewal. Observed on real
         hardware: IP missing for an entire hour with no recovery (see
         PROJECT_GUIDE.md). DHCP on a healthy LAN completes in well under a
         second, so anything stuck this long needs the same hardware-level
         kick used for wedged TCP. Lowered from 90s: that long a wait only
         delayed the inevitable - logs show ethernetif_reset() alone often
         doesn't get DHCP working again even though link/hardware recover
         fine, while a full MCU reboot reliably does within ~5s (see
         PROJECT_GUIDE.md) - so waiting it out in place wastes minutes for
         nothing. Shorter timeout = fewer wasted seconds before falling
         through to the escalation reboot below. */
      #define DHCP_STUCK_TIMEOUT_MS 15000U
      /* When ETH hardware itself is known broken (g_eth_hw_failed, set by
         low_level_init() on a HAL_ETH_Init() failure and cleared on success
         - see ethernetif.c/.h), there is nothing to "wait out":
         eth_check_refclk_pa1() already gave a definitive answer in seconds.
         Retry almost immediately instead of waiting the full
         DHCP_STUCK_TIMEOUT_MS (that long timeout exists for a genuinely
         different case - ETH hardware fine, DHCP server just
         slow/unresponsive).
         NOTE: g_eth_debug_marker==100 was used here originally, but that is
         WRONG - MX_LWIP_Init() unconditionally overwrites
         g_eth_debug_marker right after the very first low_level_init()
         call (via netif_add()), clobbering the 100 a cold-boot failure had
         just set, so that condition never actually fired on real hardware
         (confirmed: heartbeat kept showing LINK_DOWN instead of INIT_FAIL,
         and the fast retry never kicked in - the 90s DHCP_STUCK_TIMEOUT_MS
         ran every time instead). g_eth_hw_failed is written nowhere else,
         so it can't be clobbered the same way. See PROJECT_GUIDE.md. */
      #define ETH_INIT_FAIL_RETRY_MS 2000U
      /* Escalation: ethernetif_reset() alone (nRST pulse + MDIO, board
         power left on) sometimes cannot get DHCP working again even once
         the hardware/link itself recover fine - confirmed on real hardware
         that only a full MCU reboot (through main(), where nRST is now
         asserted as the very first thing - see above) reliably recovers it
         in that case. If the watchdog has had to force a reset this many
         times in a row with no successful IP in between, stop retrying in
         place and reboot the whole MCU instead, so the next boot gets the
         benefit of that early nRST assert - same effect as the manual
         "ground nRST during a restart" fix, with no human needed. Lowered
         from 3 to 2: logs show soft resets don't reliably fix this specific
         failure mode anyway, so a 3rd in-place retry is just wasted time
         that a reboot already proven to work could have used instead. See
         PROJECT_GUIDE.md. */
      #define ETH_RESET_ESCALATE_AFTER 2U
      {
        static uint32_t ip_missing_since = 0;
        static uint32_t reset_escalation_count = 0;

        if (has_ip)
        {
          ip_missing_since = 0;
          reset_escalation_count = 0;
        }
        else if (ip_missing_since == 0)
        {
          ip_missing_since = HAL_GetTick();
        }
        else if ((HAL_GetTick() - ip_missing_since) >=
                 (g_eth_hw_failed ? ETH_INIT_FAIL_RETRY_MS : DHCP_STUCK_TIMEOUT_MS))
        {
          reset_escalation_count++;
          if (reset_escalation_count >= ETH_RESET_ESCALATE_AFTER)
          {
            Debug_Print("[lwip] ETH reset escalation exhausted, rebooting MCU\r\n");
            HAL_Delay(50); /* let the UART finish transmitting before reset */
            NVIC_SystemReset();
          }
          Debug_Print("[lwip] no IP for too long, forcing ETH reset\r\n");
          ethernetif_reset(&gnetif);
          ip_missing_since = 0;
        }
      }
    }

    /* Periodic heartbeat so UART output is visible even if the terminal was
       connected after boot.  Prints every 5 s regardless of ETH state. */
    {
      static uint32_t last_hb = 0;
      if ((HAL_GetTick() - last_hb) >= 5000U)
      {
        char hb[160];
        last_hb = HAL_GetTick();
        snprintf(hb, sizeof(hb), "[alive] t=%ums eth=%s phy=%d txbuf=%lu rxalloc=%u tcp=%c heap=%u/%u sndq=%u\r\n",
                 (unsigned)HAL_GetTick(),
                 g_eth_hw_failed            ? "INIT_FAIL" :
                 netif_is_link_up(&gnetif)    ? "LINK_UP"   : "LINK_DOWN",
                 (int)g_eth_last_phy_link_state,
                 (unsigned long)EthHandle.TxDescList.BuffersInUse,
                 (unsigned)g_eth_rx_alloc_status,
                 tcp_echo_client_state_char(),
                 (unsigned)lwip_stats.mem.used, (unsigned)lwip_stats.mem.avail,
                 (unsigned)tcp_echo_client_sndqueuelen());
        Debug_Print(hb);
      }
    }
    /* USER CODE END WHILE */

